org/website-https-with-let's-Encrypt.org
*** Website https with Let's Encrypt

**** Install certbot
     my system is Arch Linux with KDE
     #+BEGIN_SRC shell
       sudo pacman -S letsencrypt
     #+END_SRC
**** Edit the configurate
     #+BEGIN_SRC shell
       mkdir /etc/letsencrypt/config
       emacs /etc/letsencrypt/config/example.com.conf
     #+END_SRC
     the example.con.conf like this:
     #+BEGIN_SRC shell
       domians=example.com
       rsa-key-size=2048
       email=your-email@example.con

       authenticator=webroot
       webroot-path=/path/to/example.com-root-path
     #+END_SRC
**** nginx configurate of example.com
     #+BEGIN_SRC shell
       vim /usr/local/nginx/conf/siteable/example.com
     #+END_SRC
**** certbot create the *.pem
     #+BEGIN_SRC shell
       certbot certonly -c /etc/letsencrypt/config/example.com.conf
     #+END_SRC
**** restart nginx
     #+BEGIN_SRC shell
       sudo nginx -s reload
     #+END_SRC
