website-https-with-let's-Encrypt.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-02-25 六 16:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title></title>
<meta name="generator" content="Org mode" />
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="stylesheet" type="text/css" href="http://www.i3s.unice.fr/~malapert/css/worg.min.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org212c85d">Website https with Let's Encrypt</a>
<ul>
<li><a href="#org6a3bc63">Install certbot</a></li>
<li><a href="#org7f0be85">Edit the configurate</a></li>
<li><a href="#org33ce800">nginx configurate of example.com</a></li>
<li><a href="#org2c3eb5a">certbot create the *.pem</a></li>
<li><a href="#org721a642">restart nginx</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org212c85d" class="outline-2">
<h2 id="org212c85d">Website https with Let's Encrypt</h2>
<div class="outline-text-2" id="text-org212c85d">
</div><div id="outline-container-org6a3bc63" class="outline-3">
<h3 id="org6a3bc63">Install certbot</h3>
<div class="outline-text-3" id="text-org6a3bc63">
<p>
my system is Arch Linux with KDE
</p>
<div class="org-src-container">
<pre class="src src-shell">sudo pacman -S letsencrypt
</pre>
</div>
</div>
</div>
<div id="outline-container-org7f0be85" class="outline-3">
<h3 id="org7f0be85">Edit the configurate</h3>
<div class="outline-text-3" id="text-org7f0be85">
<div class="org-src-container">
<pre class="src src-shell">mkdir /etc/letsencrypt/config
emacs /etc/letsencrypt/config/example.com.conf
</pre>
</div>
<p>
the example.con.conf like this:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="color: #7590db;">domians</span>=example.com
rsa-key-size=<span style="color: #a45bad;">2048</span>
<span style="color: #7590db;">email</span>=your-email@example.con

<span style="color: #7590db;">authenticator</span>=webroot
webroot-path=/path/to/example.com-root-path
</pre>
</div>
</div>
</div>
<div id="outline-container-org33ce800" class="outline-3">
<h3 id="org33ce800">nginx configurate of example.com</h3>
<div class="outline-text-3" id="text-org33ce800">
<div class="org-src-container">
<pre class="src src-shell">vim /usr/local/nginx/conf/siteable/example.com
</pre>
</div>
</div>
</div>
<div id="outline-container-org2c3eb5a" class="outline-3">
<h3 id="org2c3eb5a">certbot create the *.pem</h3>
<div class="outline-text-3" id="text-org2c3eb5a">
<div class="org-src-container">
<pre class="src src-shell">certbot certonly -c /etc/letsencrypt/config/example.com.conf
</pre>
</div>
</div>
</div>
<div id="outline-container-org721a642" class="outline-3">
<h3 id="org721a642">restart nginx</h3>
<div class="outline-text-3" id="text-org721a642">
<div class="org-src-container">
<pre class="src src-shell">sudo nginx -s reload
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<div id='disqus_thread'></div>
                <script type='text/javascript'>
                    /* * * CONFIGURATION VARIABLES * * */
                    var disqus_shortname = 'callmesanye';

                    /* * * DON'T EDIT BELOW THIS LINE * * */
                    (function() {
                        var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
                        dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
                        (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
                    })();
                </script>
                <noscript>Please enable JavaScript to view the <a href='https://disqus.com/?ref_noscript' rel='nofollow'>comments powered by Disqus.</a></noscript>
                <p> Created by <a href="http://www.gnu.org/software/emacs/">Emacs</a> 25.1.1 (<a href="http://orgmode.org">Org</a> mode 9.0.5) </p>
                <a href='#' class='back-to-top' id='fixed-back-to-top' style='display: inline;'></a>
</div>
</body>
</html>
